/*-----------------------------------------------------------------------------

 * 名称：用于规则运算元素的“原子类”（即没有与或非等复合运算的元素）
 * 作者：zhdelong@foxmail.com
 * 日期：2016.5.4

-----------------------------------------------------------------------------*/
namespace FuzzyLogicMike {
    public class FzSet :FuzzyTerm{
        /*-----------------------------------------------------------------------------
         * FzSet是FuzzySet(各种形状隶属函数类的基类)代理，m_Set即为所要代理的FuzzySet
         * 单例模式
        -----------------------------------------------------------------------------*/
        public readonly FuzzySet m_Set;
        /*-----------------------------------------------------------------------------
         * 构造方法
        -----------------------------------------------------------------------------*/
        public FzSet(FuzzySet fs) {
            m_Set = fs;
        }
        private FzSet(FzSet con) {
            m_Set = con.m_Set;
        }
        /*-----------------------------------------------------------------------------
         * 当进行复合运算（与或非）的时候，传递FzSet的拷贝到嵌套的与或非运算中
        -----------------------------------------------------------------------------*/
        public override FuzzyTerm Clone() {
            return (FuzzyTerm)new FzSet(this);
        }
        /*-----------------------------------------------------------------------------
         * 下面是对FuzzySet的一些代理方法
        -----------------------------------------------------------------------------*/
        public override  double GetDOM() {
            return m_Set.GetDOM();
        }
        public override  void ClearDOM() {
            m_Set.ClearDOM();
        }
        public override void ORwithDOM(double val) {
            m_Set.ORwithDOM(val);
        }
    }
}
